package com.jingdianjichi.auth;

import org.mybatis.spring.annotation.MapperScan;
import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.context.annotation.ComponentScan;

/**
 * 刷题微服务启动类
 *
 * @author: ChickenWing
 * @date: 2023/10/1
 */
@SpringBootApplication
@ComponentScan("com.jingdianjichi")
@MapperScan("com.jingdianjichi.**.mapper")
public class AuthApplication {

    public static void main(String[] args) {
        SpringApplication.run(AuthApplication.class);
        System.out.println("\n" +
                " █████╗ ██████╗ ███████╗ ██████╗██╗     ██╗   ██╗██████╗  █████╗ ██╗   ██╗████████╗██╗  ██╗\n"+
                "██╔══██╗██╔══██╗██╔════╝██╔════╝██║     ██║   ██║██╔══██╗██╔══██╗██║   ██║╚══██╔══╝██║  ██║\n"+
                "███████║██████╔╝█████╗  ██║     ██║     ██║   ██║██████╔╝███████║██║   ██║   ██║   ███████║\n"+
                "██╔══██║██╔═══╝ ██╔══╝  ██║     ██║     ██║   ██║██╔══██╗██╔══██║██║   ██║   ██║   ██╔══██║\n"+
                "██║  ██║██║     ███████╗╚██████╗███████╗╚██████╔╝██████╔╝██║  ██║╚██████╔╝   ██║   ██║  ██║\n"+
                "╚═╝  ╚═╝╚═╝     ╚══════╝ ╚═════╝╚══════╝ ╚═════╝ ╚═════╝ ╚═╝  ╚═╝ ╚═════╝    ╚═╝   ╚═╝  ╚═╝\n"+
                "\n" +
                "ApeClubAuth Authentication Service started successfully\n" +
                "Port: 3011 | Swagger: http://localhost:8080/doc.html\n"
        );

    }

}
