package com.jingdianjichi.wx;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.context.annotation.ComponentScan;

/**
 * 微信服务启动器
 * 
 * @author: ChickenWing
 * @date: 2023/10/11
 */
@SpringBootApplication
@ComponentScan("com.jingdianjichi")
public class WxApplication {

    public static void main(String[] args) {
        SpringApplication.run(WxApplication.class);
        System.out.println("\n" +
                " █████╗ ██████╗ ███████╗ ██████╗██╗     ██╗   ██╗██████╗ ██╗    ██╗██╗  ██╗\n"+
                "██╔══██╗██╔══██╗██╔════╝██╔════╝██║     ██║   ██║██╔══██╗██║    ██║╚██╗██╔╝\n"+
                "███████║██████╔╝█████╗  ██║     ██║     ██║   ██║██████╔╝██║ █╗ ██║ ╚███╔╝ \n"+
                "██╔══██║██╔═══╝ ██╔══╝  ██║     ██║     ██║   ██║██╔══██╗██║███╗██║ ██╔██╗ \n"+
                "██║  ██║██║     ███████╗╚██████╗███████╗╚██████╔╝██████╔╝╚███╔███╔╝██╔╝ ██╗\n"+
                "╚═╝  ╚═╝╚═╝     ╚══════╝ ╚═════╝╚══════╝ ╚═════╝ ╚═════╝  ╚══╝╚══╝ ╚═╝  ╚═╝\n"+
                "\n" +
                "ApeClubWx Service started successfully\n" +
                "WeChat integration service is ready\n"
        );
    }

}
