package com.jingdianjichi.oss;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.context.annotation.ComponentScan;

/**
 * oss服务启动器
 * 
 * @author: ChickenWing
 * @date: 2023/10/11
 */
@SpringBootApplication
@ComponentScan("com.jingdianjichi")
public class OssApplication {

    public static void main(String[] args) {
        SpringApplication.run(OssApplication.class);
        System.out.println("\n" +
                " █████╗ ██████╗ ███████╗ ██████╗██╗     ██╗   ██╗██████╗  ██████╗ ███████╗███████╗\n"+
                "██╔══██╗██╔══██╗██╔════╝██╔════╝██║     ██║   ██║██╔══██╗██╔═══██╗██╔════╝██╔════╝\n"+
                "███████║██████╔╝█████╗  ██║     ██║     ██║   ██║██████╔╝██║   ██║███████╗███████╗\n"+
                "██╔══██║██╔═══╝ ██╔══╝  ██║     ██║     ██║   ██║██╔══██╗██║   ██║╚════██║╚════██║\n"+
                "██║  ██║██║     ███████╗╚██████╗███████╗╚██████╔╝██████╔╝╚██████╔╝███████║███████║\n"+
                "╚═╝  ╚═╝╚═╝     ╚══════╝ ╚═════╝╚══════╝ ╚═════╝ ╚═════╝  ╚═════╝ ╚══════╝╚══════╝\n"+
                "\n" +
                "ApeClubOss Service started successfully\n" +
                "Object Storage Service is ready\n"
        );
    }

}
